//GPAZ08M1 JOB MSGCLASS=X,CLASS=C,NOTIFY=GPAZ08,TIME=(0,20)
// JCLLIB ORDER=GP.LB.PROCLIB
//* TROCAR 99 PELO SEU USUARIO
//MAPSAMP   EXEC DFHMAPCS,NAME=AZ08CAD,INSTR='GPAZ08',RMODE=24
